In [1]:
import pandas as pd

In [ ]:
pd.__version__

In [2]:
import numpy as np

In [ ]:
np.__version__

In [ ]:
pip install --upgrade numpy --user

In [ ]:
np.__version__

In [3]:
s1=pd.Series([2,4,6,8,'ten'],index=['a','b','c','d','e'])

In [4]:
print(s1)

a      2
b      4
c      6
d      8
e    ten
dtype: object

In [5]:
s2=pd.Series(["Python","R","C","C++","HTML"],index=[1,2,3,4,5])

In [6]:
print(s2)

1    Python
2         R
3         C
4       C++
5      HTML
dtype: object

In [7]:
s3=pd.Series(["Salma","Asma","Akbar","Arif","Sallu"],index=[1,2,3,4,5])

In [8]:
print(s3)

1    Salma
2     Asma
3    Akbar
4     Arif
5    Sallu
dtype: object

#DATA FRAME

variable_name=PD.DataFrame(data,columns=[column name])

In [19]:
df1=pd.DataFrame(s2,columns=["lang"])

In [20]:
df1

     lang
1  Python
2       R
3       C
4     C++
5    HTML

In [21]:
df1['names']=s3

In [22]:
df1

     lang  names
1  Python  Salma
2       R   Asma
3       C  Akbar
4     C++   Arif
5    HTML  Sallu

In [26]:
color={"dark":{1:"pink",2:"red",3:"black"},"light":{1:"yellow",2:"grey",3:"pink"}}

In [27]:
df2=pd.DataFrame(color,columns=["dark","light"])

In [28]:
df2

    dark   light
1   pink  yellow
2    red    grey
3  black    pink

In [31]:
cls={"name":{1:"harini",2:"hari",3:"salma",4:"aaru",5:"muzna",6:"rithish",7:"wasim",8:"deeps",9:"vijitha",10:"moushi"},"reg no":{1:11,2:12,3:13,4:14,5:15,6:16,7:17,8:18,9:19,10:20},"year of study":{1:3,2:3,3:3,4:3,5:3,6:3,7:3,8:3,9:3,10:3}}

In [33]:
cls1=pd.DataFrame(cls,columns=["name","reg no","year of study"])

In [34]:
cls1

       name reg no  year of study
1    harini     11              3
2      hari     12              3
3     salma     13              3
4      aaru     14              3
5     muzna     15              3
6   rithish     16              3
7     wasim     17              3
8     deeps     18              3
9   vijitha     19              3
10   moushi     20              3

In [35]:
reg=cls1["name"]

In [36]:
reg

1      harini
2        hari
3       salma
4        aaru
5       muzna
6     rithish
7       wasim
8       deeps
9     vijitha
10     moushi
Name: name, dtype: object

In [40]:
cls1.drop("reg no",axis=1)

       name  year of study
1    harini              3
2      hari              3
3     salma              3
4      aaru              3
5     muzna              3
6   rithish              3
7     wasim              3
8     deeps              3
9   vijitha              3
10   moushi              3